sergio1020881/MPLABX_1/Atmega128Mplab_1.X/librarias/Atmega128API.c
/*************************************************************************
ATMEGA128 API START
	API:
		1-ANALOG
		2-INTERRUPT
		3-SPI
		4-TIMER
		5-TWI (still in progress)
		6-UART
Author: Sergio Manuel Santos <sergio.salazar.santos@gmail.com>
*************************************************************************/
/***preamble inic***/
#ifndef F_CPU
	#define F_CPU 16000000UL
#endif
/*
** library
*/
#include <avr/io.h>
#include <avr/interrupt.h>
#include <avr/pgmspace.h>
#include <stdarg.h>
#include "Atmega128API.h"
/***preamble inic***/
/*
** constant and macro
*/
#ifndef GLOBAL_INTERRUPT_ENABLE
    #define GLOBAL_INTERRUPT_ENABLE 7
#endif
/*
** variables
*/
/***API LIST***/
/*************************************************************************
1-ANALOG API START
*************************************************************************/
/*
** constant and macro
*/
#if defined(__AVR_ATmega64__) || defined(__AVR_ATmega128__)
// if using differential channels this value has to be greater than one
#define MAX_CHANNEL 8
/***TYPE 1***/
#define ADC_SELECT ADMUX
#define ADC_CONTROL ADCSRA
#define MUX_MASK 31
#define GLOBAL_INTERRUPT_ENABLE 7
#define ATMEGA_ANALOG
#define ANALOG_INTERRUPT ADC_vect
/*
** variable
*/
static volatile int ADC_VALUE[MAX_CHANNEL];
static volatile int ADC_CHANNEL_GAIN[MAX_CHANNEL];
static volatile int ADC_N_CHANNEL;
static volatile int ADC_SELECTOR;
static volatile int adc_sample;
static volatile int adc_tmp;
static volatile unsigned char adc_n_sample;
/*
** procedure and function header
*/
int ANALOG_read(int selection);
/*
** procedure and function
*/
ANALOG ANALOGenable( uint8_t Vreff, uint8_t Divfactor, int n_channel, ... )
/*
* Interrupt running mode setup
* setup, and list of channels to be probed
*/
{
	/***LOCAL VARIABLES***/
	uint8_t tSREG;
	va_list list;
	int i;
	//inic variables
	tSREG=SREG;
	SREG&=~(1<<GLOBAL_INTERRUPT_ENABLE);
	/***GLOBAL VARIABLES INICIALIZE***/
	ADC_N_CHANNEL=n_channel;
	ADC_SELECTOR=0;
	adc_n_sample=0;
	//PROTOTIPOS
	//ALLOCAÇÂO MEMORIA PARA Estrutura
	ANALOG analog;
	//import parametros
	//inic parameters
	//Direccionar apontadores para PROTOTIPOS
	analog.read=ANALOG_read;
		/******/
		ADC_SELECT&=~(3<<REFS0);
		switch( Vreff ){
			case 0:
				analog.VREFF=0;
				break;
			case 1:
				ADC_SELECT|=(1<<REFS0);
				analog.VREFF=1;
				break;
			case 3:
				ADC_SELECT|=(3<<REFS0);
				analog.VREFF=3;
				break;
			default:
				analog.VREFF=0;
				break;
		}
		//
		ADC_SELECT&=~(1<<ADLAR);
		/******/
		va_start(list, n_channel);
		for(i=0;i<n_channel;i++){
			ADC_CHANNEL_GAIN[i] = va_arg(list, int);
		}
		va_end(list);
		ADC_SELECT&=~MUX_MASK;
		ADC_SELECT|=(MUX_MASK & ADC_CHANNEL_GAIN[ADC_SELECTOR]);
		/******/
		ADC_CONTROL|=(1<<ADEN);
		ADC_CONTROL|=(1<<ADSC);
		ADC_CONTROL&=~(1<<ADFR);
		ADC_CONTROL|=(1<<ADIE);
		/******/
		ADC_CONTROL&=~(7<<ADPS0);
		switch( Divfactor ){
			case 2://1
				ADC_CONTROL|=(1<<ADPS0);
				analog.DIVISION_FACTOR=2;
				break;
			case 4://2
				ADC_CONTROL|=(1<<ADPS1);
				analog.DIVISION_FACTOR=4;
				break;
			case 8://3
				ADC_CONTROL|=(3<<ADPS0);
				analog.DIVISION_FACTOR=8;
				break;
			case 16://4
				ADC_CONTROL|=(1<<ADPS2);
				analog.DIVISION_FACTOR=16;
				break;
			case 32://5
				ADC_CONTROL|=(5<<ADPS0);
				analog.DIVISION_FACTOR=32;
				break;
			case 64://6
				ADC_CONTROL|=(6<<ADPS0);
				analog.DIVISION_FACTOR=64;
				break;
			case 128://7
				ADC_CONTROL|=(7<<ADPS0);
				analog.DIVISION_FACTOR=128;
				break;
			default:
				ADC_CONTROL|=(7<<ADPS0);
				analog.DIVISION_FACTOR=128;
				break;
		}		
		
	SREG=tSREG;
	SREG|=(1<<GLOBAL_INTERRUPT_ENABLE);
	/******/
	return analog;
}
int ANALOG_read(int selection)
/*
* 
* Returns selected Channel ADC_VALUE
*/
{
	uint8_t ADSC_FLAG;
	ADSC_FLAG=(1<<ADSC);
	if( !(ADC_CONTROL & ADSC_FLAG) ){
		//ADC_SELECT
		/***/
		ADC_CONTROL|=(1<<ADSC);
	}	
	return ADC_VALUE[selection];
}
/*
** interrupt
*/
ISR(ANALOG_INTERRUPT)
/*************************************************************************
Function: ANALOG interrupt
Purpose:  Read Analog Input
**************************************************************************/
{
	/******/
	adc_tmp=ADCL;
	adc_tmp|=(ADCH<<8);
	if(adc_n_sample < (1<<ADC_NUMBER_SAMPLE)){
		adc_n_sample++;
		adc_sample+=adc_tmp;
	}else{
		ADC_VALUE[ADC_SELECTOR]=adc_sample>>ADC_NUMBER_SAMPLE;
		adc_n_sample=adc_sample=0;
		/******/
		if(ADC_SELECTOR < ADC_N_CHANNEL)
			ADC_SELECTOR++;
		else
			ADC_SELECTOR=0;
		ADC_SELECT &= ~MUX_MASK;
		ADC_SELECT |= (ADC_CHANNEL_GAIN[ADC_SELECTOR] & MUX_MASK);
	}		
}
#else
 	#error "Not Atmega 128"
#endif
/*************************************************************************
ANALOG API END
*************************************************************************/
/*************************************************************************
2-INTERRUPT API START
*************************************************************************/
/*
** constant and macro
*/
#if defined(__AVR_ATmega64__) || defined(__AVR_ATmega128__)	
#define ATMEGA_INTERRUPT
#define External_Interrupt_Control_Register_A EICRA
#define External_Interrupt_Control_Register_B EICRB
#define External_Interrupt_Mask_Register EIMSK
#define External_Interrupt_Flag_Register EIFR
#define MCU_Control_Status_Register MCUCSR
#define MCU_Control_Status_Register_Mask 0X1F
/*
** variable
*/
/*
** procedure and function header
*/
void INTERRUPT_set(uint8_t channel, uint8_t sense);
void INTERRUPT_off(uint8_t channel);
uint8_t INTERRUPT_reset_status(void);
/*
** procedure and function
*/
INTERRUPT INTERRUPTenable(void)
/*
* setup blank
*/
{
	INTERRUPT interrupt;
	External_Interrupt_Mask_Register=0X00;
	/******/
	interrupt.set=INTERRUPT_set;
	interrupt.off=INTERRUPT_off;
	interrupt.reset_status=INTERRUPT_reset_status;
	return interrupt;
}
	uint8_t INTERRUPT_reset_status(void)
	{
		uint8_t reset,ret=0;
		reset=(MCU_Control_Status_Register & MCU_Control_Status_Register_Mask);
		switch(reset){
			case 1: // Power-On Reset Flag
				ret=0;
				MCU_Control_Status_Register&=~(1<<PORF);
				break;
			case 2: // External Reset Flag
				MCU_Control_Status_Register&=~(1<<EXTRF);
				ret=1;
				break;
			case 4: // Brown-out Reset Flag
				MCU_Control_Status_Register&=~(1<<BORF);
				ret=2;
				break;
			case 8: // Watchdog Reset Flag
				MCU_Control_Status_Register&=~(1<<WDRF);
				ret=3;
				break;
			case 16: // JTAG Reset Flag
				MCU_Control_Status_Register&=~(1<<JTRF);
				ret=4;
				break;
			default: // clear all status
				MCU_Control_Status_Register&=~(MCU_Control_Status_Register_Mask);
				break;
		}
		return ret;
	}
	void INTERRUPT_set(uint8_t channel, uint8_t sense)
	{
		switch( channel ){
			case 0: 
				External_Interrupt_Mask_Register&=~(1<<INT0);
				External_Interrupt_Control_Register_A&=~((1<<ISC01) | (1<<ISC00));
				switch(sense){
					case 0: // The low level of INTn generates an interrupt request.
					case 1: // The low level of INTn generates an interrupt request.
						break;
					case 2: // The falling edge of INTn generates asynchronously an interrupt request.
						External_Interrupt_Control_Register_A|=(1<<ISC01);
						break;
					case 3: // The rising edge of INTn generates asynchronously an interrupt request.
						External_Interrupt_Control_Register_A|=((1<<ISC01) | (1<<ISC00));
						break;
					default: // The low level of INTn generates an interrupt request.
						break;
				}
				External_Interrupt_Mask_Register|=(1<<INT0);
				break;
			case 1:
				External_Interrupt_Mask_Register&=~(1<<INT1);
				External_Interrupt_Control_Register_A&=~((1<<ISC11) | (1<<ISC10));
				switch(sense){
					case 0: // The low level of INTn generates an interrupt request.
					case 1: // The low level of INTn generates an interrupt request.
						break;
					case 2: // The falling edge of INTn generates asynchronously an interrupt request.
						External_Interrupt_Control_Register_A|=(1<<ISC11);
						break;
					case 3: // The rising edge of INTn generates asynchronously an interrupt request.
						External_Interrupt_Control_Register_A|=((1<<ISC11) | (1<<ISC10));
						break;
					default: // The low level of INTn generates an interrupt request.
						break;
				}
				External_Interrupt_Mask_Register|=(1<<INT1);
				break;
			case 2:
				External_Interrupt_Mask_Register&=~(1<<INT2);
				External_Interrupt_Control_Register_A&=~((1<<ISC21) | (1<<ISC20));
				switch(sense){
					case 0: // The low level of INTn generates an interrupt request.
					case 1: // The low level of INTn generates an interrupt request.
						break;
					case 2: // The falling edge of INTn generates asynchronously an interrupt request.
						External_Interrupt_Control_Register_A|=(1<<ISC21);
						break;
					case 3: // The rising edge of INTn generates asynchronously an interrupt request.
						External_Interrupt_Control_Register_A|=((1<<ISC21) | (1<<ISC20));
						break;
					default: // The low level of INTn generates an interrupt request.
						break;
				}
				External_Interrupt_Mask_Register|=(1<<INT2);
				break;
			case 3:
				External_Interrupt_Mask_Register&=~(1<<INT3);
				External_Interrupt_Control_Register_A&=~((1<<ISC31) | (1<<ISC30));
				switch(sense){
					case 0: // The low level of INTn generates an interrupt request.
					case 1: // The low level of INTn generates an interrupt request.
						break;
					case 2: // The falling edge of INTn generates asynchronously an interrupt request.
						External_Interrupt_Control_Register_A|=(1<<ISC31);
						break;
					case 3: // The rising edge of INTn generates asynchronously an interrupt request.
						External_Interrupt_Control_Register_A|=((1<<ISC31) | (1<<ISC30));
						break;
					default: // The low level of INTn generates an interrupt request.
						break;
				}
				External_Interrupt_Mask_Register|=(1<<INT3);
				break;
			case 4:
				External_Interrupt_Mask_Register&=~(1<<INT4);
				External_Interrupt_Control_Register_B&=~((1<<ISC41) | (1<<ISC40));
				switch(sense){
					case 0: // The low level of INTn generates an interrupt request.
						break;
					case 1: // Any logical change on INTn generates an interrupt request
						External_Interrupt_Control_Register_B|=(1<<ISC40);
						break;
					case 2: // The falling edge between two samples of INTn generates an interrupt request.
						External_Interrupt_Control_Register_B|=(1<<ISC41);
						break;
					case 3: // The rising edge between two samples of INTn generates an interrupt request.
						External_Interrupt_Control_Register_B|=((1<<ISC41) | (1<<ISC40));
						break;
					default: // The low level of INTn generates an interrupt request.
						break;
				}
				External_Interrupt_Mask_Register|=(1<<INT4);
				break;
			case 5:
				External_Interrupt_Mask_Register&=~(1<<INT5);
				External_Interrupt_Control_Register_B&=~((1<<ISC51) | (1<<ISC50));
				switch(sense){
					case 0: // The low level of INTn generates an interrupt request.
						break;
					case 1: // Any logical change on INTn generates an interrupt request
						External_Interrupt_Control_Register_B|=(1<<ISC50);
						break;
					case 2: // The falling edge between two samples of INTn generates an interrupt request.
						External_Interrupt_Control_Register_B|=(1<<ISC51);
						break;
					case 3: // The rising edge between two samples of INTn generates an interrupt request.
						External_Interrupt_Control_Register_B|=((1<<ISC51) | (1<<ISC50));
						break;
					default: // The low level of INTn generates an interrupt request.
						break;
				}
				External_Interrupt_Mask_Register|=(1<<INT5);
				break;
			case 6:
				External_Interrupt_Mask_Register&=~(1<<INT6);
				External_Interrupt_Control_Register_B&=~((1<<ISC61) | (1<<ISC60));
				switch(sense){
					case 0: // The low level of INTn generates an interrupt request.
						break;
					case 1: // Any logical change on INTn generates an interrupt request
						External_Interrupt_Control_Register_B|=(1<<ISC60);
						break;
					case 2: // The falling edge between two samples of INTn generates an interrupt request.
						External_Interrupt_Control_Register_B|=(1<<ISC61);
						break;
					case 3: // The rising edge between two samples of INTn generates an interrupt request.
						External_Interrupt_Control_Register_B|=((1<<ISC61) | (1<<ISC60));
						break;
					default: // The low level of INTn generates an interrupt request.
						break;
				}
				External_Interrupt_Mask_Register|=(1<<INT6);
				break;
			case 7:
				External_Interrupt_Mask_Register&=~(1<<INT7);
				External_Interrupt_Control_Register_B&=~((1<<ISC71) | (1<<ISC70));
				switch(sense){
					case 0: // The low level of INTn generates an interrupt request.
						break;
					case 1: // Any logical change on INTn generates an interrupt request
						External_Interrupt_Control_Register_B|=(1<<ISC70);
						break;
					case 2: // The falling edge between two samples of INTn generates an interrupt request.
						External_Interrupt_Control_Register_B|=(1<<ISC71);
						break;
					case 3: // The rising edge between two samples of INTn generates an interrupt request.
						External_Interrupt_Control_Register_B|=((1<<ISC71) | (1<<ISC70));
						break;
					default: // The low level of INTn generates an interrupt request.
						break;
				}
				External_Interrupt_Mask_Register|=(1<<INT7);
				break;
			default:
				External_Interrupt_Mask_Register=0X00;
				break;
		}
	}
	void INTERRUPT_off(uint8_t channel)
	{
		switch( channel ){
			case 0: // desable
				External_Interrupt_Mask_Register&=~(1<<INT0);
				break;
			case 1: // desable
				External_Interrupt_Mask_Register&=~(1<<INT1);
				break;
			case 2: // desable
				External_Interrupt_Mask_Register&=~(1<<INT2);
				break;
			case 3: // desable
				External_Interrupt_Mask_Register&=~(1<<INT3);
				break;
			case 4: // desable
				External_Interrupt_Mask_Register&=~(1<<INT4);
				break;
			case 5: // desable
				External_Interrupt_Mask_Register&=~(1<<INT5);
				break;
			case 6: // desable
				External_Interrupt_Mask_Register&=~(1<<INT6);
				break;
			case 7: // desable
				External_Interrupt_Mask_Register&=~(1<<INT7);
				break;
			default: // all disable
				External_Interrupt_Mask_Register=0X00;
				break;
		}
	}

