sergio1020881/MPLABX_1/Atmega128Mplab_1.X/librarias/Atmega128API.c
/*
** interrupt
*/
#else
 	#error "Not Atmega 128"
#endif
/*************************************************************************
INTERRUPT API END
*************************************************************************/
/*************************************************************************
3-SPI API START
*************************************************************************/
/*
** constant and macro
*/
#if defined(__AVR_ATmega64__) || defined(__AVR_ATmega128__) 
#define ATMEGA_SPI
#define SPI_CONTROL_REGISTER SPCR
#define SPI_STATUS_REGISTER SPSR
#define SPI_DATA_REGISTER SPDR
#define SPI_PORT PORTB
#define SPI_DDR DDRB
#define SPI_PIN PINB
#define SPI_PIN_MASK 15
#define DD_SS 0
#define DD_SCK 1
#define DD_MOSI 2
#define DD_MISO 3
/*
** variable
*/
/*
** procedure and function header
*/
void spi_default(void);
void spi_transfer_sync (uint8_t * dataout, uint8_t * datain, uint8_t len);
void spi_transmit_sync (uint8_t * dataout, uint8_t len);
uint8_t spi_fast_shift (uint8_t data);
/*
** procedure and function
*/
SPI SPIenable(uint8_t master_slave_select, uint8_t data_order,  uint8_t data_modes, uint8_t prescaler)
{
	SPI spi;
	spi.transfer_sync = spi_transfer_sync;
	spi.transmit_sync = spi_transmit_sync;
	spi.fast_shift = spi_fast_shift;
	/***/
	SPI_DDR &= ~((1<<DD_MOSI)|(1<<DD_MISO)|(1<<DD_SS)|(1<<DD_SCK));
	switch(master_slave_select){
		case SPI_MASTER_MODE:
			SPI_CONTROL_REGISTER |= (1<<MSTR);
			SPI_DDR |= (1<<DD_SS) | (1<<DD_MOSI) | (1<<DD_SCK);
			SPI_PORT |= (1<<DD_SS);
			break;
		case SPI_SLAVE_MODE:
			SPI_CONTROL_REGISTER |= (1<<MSTR);
			SPI_DDR |= (1<<DD_MISO);
			break;
		default:
			SPI_CONTROL_REGISTER |= (1<<MSTR);
			SPI_DDR |= (1<<DD_SS) | (1<<DD_MOSI) | (1<<DD_SCK);
			break;
	}
	switch(data_order){
		case SPI_LSB_DATA_ORDER:
			SPI_CONTROL_REGISTER |= (1<<DORD);
			break;
		case SPI_MSB_DATA_ORDER:
			SPI_CONTROL_REGISTER &= ~(1<<DORD);
			break;
		default:
			SPI_CONTROL_REGISTER &= ~(1<<DORD);
			break;
	}
	switch(data_modes){
		case 0:
			SPI_CONTROL_REGISTER &= ~((1<<CPOL) | (1<<CPHA));
			break;
		case 1:
			SPI_CONTROL_REGISTER |= (1<<CPHA);
			break;
		case 2:
			SPI_CONTROL_REGISTER |= (1<<CPOL);
			break;
		case 3:
			SPI_CONTROL_REGISTER |= (1<<CPOL) | (1<<CPHA);
			break;
		default:
			SPI_CONTROL_REGISTER &= ~((1<<CPOL) | (1<<CPHA));
			break;
	}
	switch(prescaler){
		case 2:
			SPI_STATUS_REGISTER |= (1<<SPI2X);
			SPI_CONTROL_REGISTER &= ~((1<<SPR1) | (1<<SPR0));
			break;
		case 4:
			SPI_STATUS_REGISTER &= ~(1<<SPI2X);
			SPI_CONTROL_REGISTER &= ~((1<<SPR1) | (1<<SPR0));
			break;
		case 8:
			SPI_STATUS_REGISTER |= (1<<SPI2X);
			SPI_CONTROL_REGISTER |= (1<<SPR0);
			break;
		case 16:
			SPI_STATUS_REGISTER &= ~(1<<SPI2X);
			SPI_CONTROL_REGISTER |= (1<<SPR0);
			break;
		case 32:
			SPI_STATUS_REGISTER |= (1<<SPI2X);
			SPI_CONTROL_REGISTER |= (1<<SPR1);
			break;
		case 64:
			SPI_STATUS_REGISTER &= ~(1<<SPI2X);
			SPI_CONTROL_REGISTER |= (1<<SPR1);
			break;
		case 128:
			SPI_STATUS_REGISTER &= (1<<SPI2X);
			SPI_CONTROL_REGISTER |= (1<<SPR1) | (1<<SPR0);
			break;
		default:
			SPI_STATUS_REGISTER |= (1<<SPI2X);
			SPI_CONTROL_REGISTER |= (1<<SPR0);
			break;
	}
	SPI_CONTROL_REGISTER |= (1<<SPE);
	return spi;
}
void spi_default()
// Initialize pins for spi communication
{
    SPI_DDR &= ~((1<<DD_MOSI)|(1<<DD_MISO)|(1<<DD_SS)|(1<<DD_SCK));
    // Define the following pins as output
    SPI_DDR |= ((1<<DD_MOSI)|(1<<DD_SS)|(1<<DD_SCK)); 
    SPI_CONTROL_REGISTER =	((1<<SPE)|              // SPI Enable
							(0<<SPIE)|              // SPI Interrupt Enable
							(0<<DORD)|              // Data Order (0:MSB first / 1:LSB first)
							(1<<MSTR)|              // Master/Slave select   
							(0<<SPR1)|(1<<SPR0)|    // SPI Clock Rate
							(0<<CPOL)|              // Clock Polarity (0:SCK low / 1:SCK hi when idle)
							(0<<CPHA));             // Clock Phase (0:leading / 1:trailing edge sampling)
    SPI_STATUS_REGISTER =	(1<<SPI2X);             // Double Clock Rate  
}
void spi_transfer_sync (uint8_t * dataout, uint8_t * datain, uint8_t len)
// Shift full array through target device
{
       uint8_t i;      
       for (i = 0; i < len; i++) {
             SPI_DATA_REGISTER = dataout[i];
             while((SPI_STATUS_REGISTER & (1<<SPIF))==0); // polling, serial transfer is complete interrupt.
             datain[i] = SPI_DATA_REGISTER;
       }
}
void spi_transmit_sync (uint8_t * dataout, uint8_t len)
// Shift full array to target device without receiving any byte
{
       uint8_t i;      
       for (i = 0; i < len; i++) {
             SPI_DATA_REGISTER = dataout[i];
             while((SPI_STATUS_REGISTER & (1<<SPIF))==0); // polling, serial transfer is complete interrupt.
       }
}
uint8_t spi_fast_shift (uint8_t data)
// Clocks only one byte to target device and returns the received one
{
    SPI_DATA_REGISTER = data;
    while((SPI_STATUS_REGISTER & (1<<SPIF))==0)
		; // polling, serial transfer is complete interrupt.
    return SPI_DATA_REGISTER;
}
/*
** interrupt
*/
#else
	#error "Not Atmega 128"
#endif
/*************************************************************************
SPI API END
*************************************************************************/
/*************************************************************************
4-TIMER API START
*************************************************************************/
/*
** constant and macro
*/
#if defined(__AVR_ATmega64__) || defined(__AVR_ATmega128__)
/***0***/
#define ATMEGA_TIMER_COUNTER
#define TIMER_COUNTER0_CONTROL_REGISTER TCCR0
#define TIMER_COUNTER0_REGISTER TCNT0
#define TIMER_COUNTER0_COMPARE_REGISTER OCR0
#define TIMER_COUNTER0_COMPARE_MATCH_INTERRUPT TIMER0_COMP_vect
#define TIMER_COUNTER0_OVERFLOW_INTERRUPT TIMER0_OVF_vect
/***1***/
#define TIMER_COUNTER1A_CONTROL_REGISTER TCCR1A
#define TIMER_COUNTER1B_CONTROL_REGISTER TCCR1B
#define TIMER_COUNTER1C_CONTROL_REGISTER TCCR1C
#define TIMER_COUNTER1_REGISTER TCNT1 // H and L register
#define TIMER_COUNTER1A_COMPARE_REGISTER OCR1A
#define TIMER_COUNTER1B_COMPARE_REGISTER OCR1B
#define TIMER_COUNTER1C_COMPARE_REGISTER OCR1C
#define TIMER_COUNTER1_INPUT_CAPTURE_REGISTER ICR1
#define TIMER_COUNTER1A_COMPARE_MATCH_INTERRUPT TIMER1_COMPA_vect
#define TIMER_COUNTER1B_COMPARE_MATCH_INTERRUPT TIMER1_COMPB_vect
#define TIMER_COUNTER1C_COMPARE_MATCH_INTERRUPT TIMER1_COMPC_vect
#define TIMER_COUNTER1_CAPTURE_EVENT_INTERRUPT TIMER1_CAPT_vect
#define TIMER_COUNTER1_OVERFLOW_INTERRUPT TIMER1_OVF_vect
/***2***/
#define TIMER_COUNTER2_CONTROL_REGISTER TCCR2
#define TIMER_COUNTER2_REGISTER TCNT2
#define TIMER_COUNTER2_COMPARE_REGISTER OCR2
#define TIMER_COUNTER2_COMPARE_MATCH_INTERRUPT TIMER2_COMP_vect
#define TIMER_COUNTER2_OVERFLOW_INTERRUPT TIMER2_OVF_vect
/***3***/
#define TIMER_COUNTER3A_CONTROL_REGISTER TCCR3A
#define TIMER_COUNTER3B_CONTROL_REGISTER TCCR3B
#define TIMER_COUNTER3C_CONTROL_REGISTER TCCR3C
#define TIMER_COUNTER3_REGISTER TCNT3 // H and L register
#define TIMER_COUNTER3A_COMPARE_REGISTER OCR3A
#define TIMER_COUNTER3B_COMPARE_REGISTER OCR3B
#define TIMER_COUNTER3C_COMPARE_REGISTER OCR3C
#define TIMER_COUNTER3_INPUT_CAPTURE_REGISTER ICR3
#define TIMER_COUNTER3A_COMPARE_MATCH_INTERRUPT TIMER3_COMPA_vect
#define TIMER_COUNTER3B_COMPARE_MATCH_INTERRUPT TIMER3_COMPB_vect
#define TIMER_COUNTER3C_COMPARE_MATCH_INTERRUPT TIMER3_COMPC_vect
#define TIMER_COUNTER3_CAPTURE_EVENT_INTERRUPT TIMER3_CAPT_vect
#define TIMER_COUNTER3_OVERFLOW_INTERRUPT TIMER3_OVF_vect
/***COMMON***/
#define TIMER_COUNTER_STATUS_REGISTER ASSR
#define TIMER_COUNTER_INTERRUPT_MASK_REGISTER TIMSK
#define EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER ETIMSK
#define TIMER_COUNTER_INTERRUPT_FLAG_REGISTER TIFR
#define EXTENDED_TIMER_COUNTER_INTERRUPT_FLAG_REGISTER ETIFR
#define TIMER_COUNTER_SPECIAL_FUNCTION_REGISTER SFIOR
#define ASYNCHRONOUS_STATUS_REGISTER ASSR
#define SPECIAL_FUNCTION_IO_REGISTER SFIOR
/*
** variable
*/
unsigned char timer0_state;
unsigned char timer1_state;
unsigned char timer2_state;
unsigned char timer3_state;
/*
** procedure and function header
*/
void TIMER_COUNTER0_compoutmode(unsigned char compoutmode);
void TIMER_COUNTER0_compoutmodeA(unsigned char compoutmode);
void TIMER_COUNTER0_compoutmodeB(unsigned char compoutmode);
void TIMER_COUNTER0_compare(unsigned char compare);
void TIMER_COUNTER0_compareA(unsigned char compare);
void TIMER_COUNTER0_compareB(unsigned char compare);
void TIMER_COUNTER0_start(unsigned int prescaler);
void TIMER_COUNTER0_stop(void);
/******/
void TIMER_COUNTER1_compoutmodeA(unsigned char compoutmode);
void TIMER_COUNTER1_compoutmodeB(unsigned char compoutmode);
void TIMER_COUNTER1_compoutmodeC(unsigned char compoutmode);
void TIMER_COUNTER1_compareA(uint16_t compare);
void TIMER_COUNTER1_compareB(uint16_t compare);
void TIMER_COUNTER1_compareC(uint16_t compare);
void TIMER_COUNTER1_start(unsigned int prescaler);
void TIMER_COUNTER1_stop(void);
/******/
void TIMER_COUNTER2_compoutmode(unsigned char compoutmode);
void TIMER_COUNTER2_compoutmodeA(unsigned char compoutmode);
void TIMER_COUNTER2_compoutmodeB(unsigned char compoutmode);
void TIMER_COUNTER2_compare(unsigned char compare);
void TIMER_COUNTER2_compareA(unsigned char compare);
void TIMER_COUNTER2_compareB(unsigned char compare);
void TIMER_COUNTER2_start(unsigned int prescaler);
void TIMER_COUNTER2_stop(void);
/******/
void TIMER_COUNTER3_compoutmodeA(unsigned char compoutmode);
void TIMER_COUNTER3_compoutmodeB(unsigned char compoutmode);
void TIMER_COUNTER3_compoutmodeC(unsigned char compoutmode);
void TIMER_COUNTER3_compareA(uint16_t compare);
void TIMER_COUNTER3_compareB(uint16_t compare);
void TIMER_COUNTER3_compareC(uint16_t compare);
void TIMER_COUNTER3_start(unsigned int prescaler);
void TIMER_COUNTER3_stop(void);
/*
** procedure and function
*/
TIMER_COUNTER0 TIMER_COUNTER0enable(unsigned char wavegenmode, unsigned char interrupt)
/*
	PARAMETER SETTING
	wavegen mode: Normal; PWM phase correct; Fast PWM; default-Normasl;
	interrupt: off; overflow; output compare; both; default - non.
*/
{
	TIMER_COUNTER0 timer0;
	timer0_state=0;
		TIMER_COUNTER0_CONTROL_REGISTER&=~((1<<WGM00) | (1<<WGM01));
		switch(wavegenmode){
			case 0: // Normal
				break;
			case 1: // PWM, Phase Correct
				TIMER_COUNTER0_CONTROL_REGISTER|=(1<<WGM00);
				break;
			case 2: // CTC
				TIMER_COUNTER0_CONTROL_REGISTER|=(1<<WGM01);
				break;
			case 3: // Fast PWM
				TIMER_COUNTER0_CONTROL_REGISTER|=(1<<WGM00) | (1<<WGM01);
				break;
			default:
				break;
		}
		TIMER_COUNTER_INTERRUPT_MASK_REGISTER&=~(1<<TOIE0);
		TIMER_COUNTER_INTERRUPT_MASK_REGISTER&=~(1<<OCIE0);
		switch(interrupt){
			case 0: 
				break;
			case 1:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TOIE0);
				break;
			case 2:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE0);
				break;
			case 3:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TOIE0);
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE0);
				break;
			default:
				break;
		}
		timer0.compoutmode=TIMER_COUNTER0_compoutmode;
		timer0.compare=TIMER_COUNTER0_compare;
		timer0.start=TIMER_COUNTER0_start;
		timer0.stop=TIMER_COUNTER0_stop;
	
	return timer0;
}
/*****************************************************************************************/
TIMER_COUNTER1 TIMER_COUNTER1enable(unsigned char wavegenmode, unsigned char interrupt)
/*
	PARAMETER SETTING
	wavegen mode: Normal; PWM, Phase Correct, 8-bit; PWM, Phase Correct, 9-bit; PWM, Phase Correct, 10-bit;
	CTC; Fast PWM, 8-bit; Fast PWM, 9-bit; Fast PWM, 10-bit; PWM, Phase and Frequency Correct; PWM, Phase and Frequency Correct;
	PWM, Phase Correct; PWM, Phase Correct; CTC; (Reserved); Fast PWM; Fast PWM.
	interrupt: off; overflow; output compare; both; default - non.
	for more information read datasheet.
*/
{
	TIMER_COUNTER1 timer1;
	timer1_state=0;
		TIMER_COUNTER1A_CONTROL_REGISTER&=~((1<<WGM11) | (1<<WGM10));
		TIMER_COUNTER1B_CONTROL_REGISTER&=~((1<<WGM13) | (1<<WGM12));
		switch(wavegenmode){
			case 0: // Normal
				break;
			case 1: // PWM, Phase Correct, 8-bit
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<WGM10);
				break;
			case 2:	// PWM, Phase Correct, 9-bit
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<WGM11);
				break;
			case 3:	// PWM, Phase Correct, 10-bit
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<WGM11) | (1<<WGM10);
				break;
			case 4:	// CTC
				TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<WGM12);
				break;
			case 5:	// Fast PWM, 8-bit
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<WGM10);
				TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<WGM12);
				break;
			case 6:	// Fast PWM, 9-bit
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<WGM11);
				TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<WGM12);
				break;
			case 7:	// Fast PWM, 10-bit
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<WGM11) | (1<<WGM10);
				TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<WGM12);
				break;
			case 8:	// PWM, Phase and Frequency Correct
				TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<WGM13);
				break;
			case 9:	// PWM, Phase and Frequency Correct
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<WGM10);
				TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<WGM13);
				break;
			case 10: // PWM, Phase Correct
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<WGM11);
				TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<WGM13);
				break;
			case 11: // PWM, Phase Correct
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<WGM11) | (1<<WGM10);
				TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<WGM13);
				break;
			case 12: // CTC
				TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<WGM13) | (1<<WGM12);
				break;
			case 13: // (Reserved)
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<WGM10);
				TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<WGM13) | (1<<WGM12);
				break;
			case 14: // Fast PWM
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<WGM11);
				TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<WGM13) | (1<<WGM12);
				break;
			case 15: // Fast PWM
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<WGM11) | (1<<WGM10);
				TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<WGM13) | (1<<WGM12);
				break;
			default:
				break;
		}
		TIMER_COUNTER1A_CONTROL_REGISTER&=~((3<<COM1A0) | (3<<COM1B0) | (3<<COM1C0));
		TIMER_COUNTER_INTERRUPT_MASK_REGISTER&=~((1<<TICIE1) | (1<<OCIE1A) | (1<<OCIE1B) | (1<<TOIE1));
		EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER&=~(1<<OCIE1C);
		switch(interrupt){
			case 0:
				break;
			case 1:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TOIE1);
				break;
			case 2:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE1A);
				break;
			case 3:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE1B);
				break;
			case 4:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE1C);
				break;
			case 5:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TICIE1);
				break;
			case 6:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE1A) | (1<<TOIE1);
				break;
			case 7:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE1B) | (1<<TOIE1);
				break;
			case 8:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TOIE1);
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE1C);
				break;
			case 9:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TICIE1) | (1<<TOIE1);
				break;
			case 10:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE1A) | (1<<OCIE1B) | (1<<TOIE1);
				break;
			case 11:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE1A) | (1<<OCIE1B) | (1<<TOIE1);
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE1C);
				break;
			case 12:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE1A) | (1<<OCIE1B);
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE1C);
				break;
			default:
				break;
		}
		//
		timer1.compoutmodeA=TIMER_COUNTER1_compoutmodeA;
		timer1.compoutmodeB=TIMER_COUNTER1_compoutmodeB;
		timer1.compoutmodeC=TIMER_COUNTER1_compoutmodeC;
		timer1.compareA=TIMER_COUNTER1_compareA;
		timer1.compareB=TIMER_COUNTER1_compareB;
		timer1.compareC=TIMER_COUNTER1_compareC;
		timer1.start=TIMER_COUNTER1_start;
		timer1.stop=TIMER_COUNTER1_stop;
	
	//
	return timer1;
}
/*****************************************************************************************/
TIMER_COUNTER2 TIMER_COUNTER2enable(unsigned char wavegenmode, unsigned char interrupt)
	/*
		PARAMETER SETTING
		wavegen mode: Normal; PWM phase correct; Fast PWM; default-Normasl;
		interrupt: off; overflow; output compare; both; default - non.
	*/
{
	TIMER_COUNTER2 timer2;
	timer2_state=0;
		TIMER_COUNTER2_CONTROL_REGISTER&=~((1<<WGM20) | (1<<WGM21));
		switch(wavegenmode){
			case 0: // Normal
				break;
			case 1: // PWM, Phase Correct
				TIMER_COUNTER2_CONTROL_REGISTER|=(1<<WGM20);
				break;
			case 2: // CTC
				TIMER_COUNTER2_CONTROL_REGISTER|=(1<<WGM21);
				break;
			case 3: // Fast PWM
				TIMER_COUNTER2_CONTROL_REGISTER|=(1<<WGM20) | (1<<WGM21);
				break;
			default:
				break;
		}
		TIMER_COUNTER_INTERRUPT_MASK_REGISTER&=~((1<<TOIE2) | (1<<OCIE2));
		switch(interrupt){
			case 0: 
				break;
			case 1:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TOIE2);
				break;
			case 2:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE2);
				break;
			case 3:
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TOIE2);
				TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE2);
				break;
			default:
				break;
		}
		timer2.compoutmode=TIMER_COUNTER2_compoutmode;
		timer2.compare=TIMER_COUNTER2_compare;
		timer2.start=TIMER_COUNTER2_start;
		timer2.stop=TIMER_COUNTER2_stop;
	
