sergio1020881/MPLABX_1/Atmega128Mplab_1.X/librarias/Atmega128API.c
	return timer2;
}
	void TIMER_COUNTER0_start(unsigned int prescaler)
	/*
		PARAMETER SETTING
		Frequency oscilator devision factor or prescaler.
		prescaler: clk T0S /(No prescaling); clk T0S /8 (From prescaler); clk T0S /32 (From prescaler);
		clk T0S /64 (From prescaler); clk T0S /128 (From prescaler); clk T 0 S /256 (From prescaler);
		clk T 0 S /1024 (From prescaler); default - clk T 0 S /1024 (From prescaler).
	*/
	{
		if(timer0_state==0){ // oneshot
			TIMER_COUNTER0_COMPARE_REGISTER=0XFF;
			TIMER_COUNTER0_CONTROL_REGISTER&=~(7<<CS00); // No clock source. (Timer/Counter stopped)
			switch(prescaler){
				case 1: // clk T0S /(No prescaling)
					TIMER_COUNTER0_CONTROL_REGISTER|=(1<<CS00);
					break;
				case 8: // clk T0S /8 (From prescaler)
					TIMER_COUNTER0_CONTROL_REGISTER|=(1<<CS01);
					break;
				case 32: // clk T0S /32 (From prescaler)
					TIMER_COUNTER0_CONTROL_REGISTER|=(3<<CS00);
					break;
				case 64: // clk T0S /64 (From prescaler)
					TIMER_COUNTER0_CONTROL_REGISTER|=(4<<CS00);
					break;
				case 128: // clk T0S /128 (From prescaler)
					TIMER_COUNTER0_CONTROL_REGISTER|=(5<<CS00);
					break;
				case 256: // clk T 0 S /256 (From prescaler)
					TIMER_COUNTER0_CONTROL_REGISTER|=(6<<CS00);
					break;
				case 1024: // clk T 0 S /1024 (From prescaler)
					TIMER_COUNTER0_CONTROL_REGISTER|=(7<<CS00);
					break;
				default:
					TIMER_COUNTER0_CONTROL_REGISTER|=(7<<CS00);
					break;
			}
			timer0_state=1;
		}	
	}
	void TIMER_COUNTER0_compoutmode(unsigned char compoutmode)
	/*
		compoutmode: Normal port operation, OC0 disconnected; Toggle OC0 on compare match; 
		Clear OC0 on compare match when up-counting. Set OC0 on compare match when downcounting. Clear OC0 on compare match;
		Set OC0 on compare match when up-counting. Clear OC0 on compare match when downcounting. Set OC0 on compare match ;
		default-Normal port operation, OC0 disconnected.
	*/
	{
		TIMER_COUNTER0_CONTROL_REGISTER&=~((1<<COM00) | (1<<COM01));
		switch(compoutmode){ // see table 53, 54, 55 in datasheet for more information
			case 0: // Normal port operation, OC0 disconnected.
				break;
			case 1: // Reserved
					// Toggle OC0 on compare match
				TIMER_COUNTER0_CONTROL_REGISTER|=(1<<COM00);
				break;
			case 2: // Clear OC0 on compare match when up-counting. Set OC0 on compare
					// match when downcounting.
					// Clear OC0 on compare match
				TIMER_COUNTER0_CONTROL_REGISTER|=(1<<COM01);
				break;
			case 3: // Set OC0 on compare match when up-counting. Clear OC0 on compare
					// match when downcounting.
					// Set OC0 on compare match
				TIMER_COUNTER0_CONTROL_REGISTER|=(1<<COM00) | (1<<COM01);
				break;
			default:
				break;
		}
	}
	void TIMER_COUNTER0_compare(unsigned char compare)
	{
		TIMER_COUNTER0_COMPARE_REGISTER=compare;
	}
	void TIMER_COUNTER0_stop(void)
	/*
		stops timer by setting prescaler to zero
	*/
	{
		TIMER_COUNTER0_CONTROL_REGISTER&=~(7<<CS00); // No clock source. (Timer/Counter stopped)
		TIMER_COUNTER0_REGISTER=0X00;
		timer0_state=0;
	}
	/*****************************************************************************************/
	void TIMER_COUNTER1_start(unsigned int prescaler)
	/*
		PARAMETER SETTING
		Frequency oscilator devision factor or prescaler.
		prescaler: clk T0S /(No prescaling); clk T0S /8 (From prescaler); clk T0S /64 (From prescaler);
		clk T0S /256 (From prescaler); clk T0S /1024 (From prescaler); External clock source on Tn pin. Clock on falling edge;
		External clock source on Tn pin. Clock on rising edge; default - clk T 0 S /1024 (From prescaler).
	*/
	{
		if(timer1_state==0){ // oneshot
			TIMER_COUNTER1A_COMPARE_REGISTER=0XFFFF;
			TIMER_COUNTER1B_CONTROL_REGISTER&=~(7<<CS10); // No clock source. (Timer/Counter stopped)
			switch(prescaler){
				case 1: // clkI/O/1 (No prescaling
					TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<CS10);
					break;
				case 8: // clkI/O/8 (From prescaler)
					TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<CS11);
					break;
				case 64: // clkI/O/64 (From prescaler)
					TIMER_COUNTER1B_CONTROL_REGISTER|=(3<<CS10);
					break;
				case 256: // clkI/O/256 (From prescaler)
					TIMER_COUNTER1B_CONTROL_REGISTER|=(1<<CS12);
					break;
				case 1024: // clkI/O/1024 (From prescaler)
					TIMER_COUNTER1B_CONTROL_REGISTER|=(5<<CS10);
					break;
				case 3: // External clock source on Tn pin. Clock on falling edge
					TIMER_COUNTER1B_CONTROL_REGISTER|=(6<<CS10);
					break;
				case 5: // External clock source on Tn pin. Clock on rising edge
					TIMER_COUNTER1B_CONTROL_REGISTER|=(7<<CS10);
					break;
				default:
					TIMER_COUNTER1B_CONTROL_REGISTER|=(5<<CS10);
					break;
			}
			timer1_state=1;
		}	
	}
	void TIMER_COUNTER1_compoutmodeA(unsigned char compoutmode)
	{
		TIMER_COUNTER1A_CONTROL_REGISTER&=~(3<<COM1A0);
		switch(compoutmode){ // see table 53, 54, 55 in datasheet for more information
			case 0: // Normal port operation, OC0 disconnected.
				break;
			case 1: // Reserved
					// Toggle OC0 on compare match
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<COM1A0);
				break;
			case 2: // Clear OC0 on compare match when up-counting. Set OC0 on compare
					// match when downcounting.
					// Clear OC0 on compare match
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<COM1A1);
				break;
			case 3: // Set OC0 on compare match when up-counting. Clear OC0 on compare
					// match when downcounting.
					// Set OC0 on compare match
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<COM1A0) | (1<<COM1A1);
				break;
			default:
				break;
		}
	}
	void TIMER_COUNTER1_compoutmodeB(unsigned char compoutmode)
	{
		TIMER_COUNTER1A_CONTROL_REGISTER&=~(3<<COM1B0);
		switch(compoutmode){ // see table 53, 54, 55 in datasheet for more information
			case 0: // Normal port operation, OC0 disconnected.
				break;
			case 1: // Reserved
					// Toggle OC0 on compare match
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<COM1B0);
				break;
			case 2: // Clear OC0 on compare match when up-counting. Set OC0 on compare
					// match when downcounting.
					// Clear OC0 on compare match
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<COM1B1);
				break;
			case 3: // Set OC0 on compare match when up-counting. Clear OC0 on compare
					// match when downcounting.
					// Set OC0 on compare match
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<COM1B0) | (1<<COM1B1);
				break;
			default:
				break;
		}
	}
	void TIMER_COUNTER1_compoutmodeC(unsigned char compoutmode)
	{
		TIMER_COUNTER1A_CONTROL_REGISTER&=~(3<<COM1C0);
		switch(compoutmode){ // see table 53, 54, 55 in datasheet for more information
			case 0: // Normal port operation, OC0 disconnected.
				break;
			case 1: // Reserved
					// Toggle OC0 on compare match
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<COM1C0);
				break;
			case 2: // Clear OC0 on compare match when up-counting. Set OC0 on compare
					// match when downcounting.
					// Clear OC0 on compare match
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<COM1C1);
				break;
			case 3: // Set OC0 on compare match when up-counting. Clear OC0 on compare
					// match when downcounting.
					// Set OC0 on compare match
				TIMER_COUNTER1A_CONTROL_REGISTER|=(1<<COM1C0) | (1<<COM1C1);
				break;
			default:
				break;
		}
	}
	void TIMER_COUNTER1_compareA(uint16_t compare)
	{
		TIMER_COUNTER1A_COMPARE_REGISTER=compare;
	}
	void TIMER_COUNTER1_compareB(uint16_t compare)
	{
		TIMER_COUNTER1B_COMPARE_REGISTER=compare;
	}
	void TIMER_COUNTER1_compareC(uint16_t compare)
	{
		TIMER_COUNTER1C_COMPARE_REGISTER=compare;
	}
	void TIMER_COUNTER1_stop(void)
	/*
		stops timer by setting prescaler to zero
	*/
	{
		TIMER_COUNTER1B_CONTROL_REGISTER&=~(7<<CS10); // No clock source. (Timer/Counter stopped)
		TIMER_COUNTER1_REGISTER=0X0000;
		timer1_state=0;
	}
	/*****************************************************************************************/
	void TIMER_COUNTER2_start(unsigned int prescaler)
	/*
		PARAMETER SETTING
		Frequency oscilator devision factor or prescaler.
		prescaler: clk T0S /(No prescaling); clk T0S /8 (From prescaler); clk T0S /64 (From prescaler);
		clk T0S /256 (From prescaler); clk T0S /1024 (From prescaler); External clock source on Tn pin. Clock on falling edge;
		External clock source on Tn pin. Clock on rising edge; default - clk T 0 S /1024 (From prescaler).
	*/
	{
		if(timer2_state==0){ // oneshot
			TIMER_COUNTER2_COMPARE_REGISTER=0XFF;
			TIMER_COUNTER2_CONTROL_REGISTER&=~(7<<CS20); // No clock source. (Timer/Counter stopped)
			switch(prescaler){
				case 1: // clkI/O/(No prescaling)
					TIMER_COUNTER2_CONTROL_REGISTER|=(1<<CS20);
					break;
				case 8: // clkI/O/8 (From prescaler)
					TIMER_COUNTER2_CONTROL_REGISTER|=(1<<CS21);
					break;
				case 64: // clkI/O/64 (From prescaler)
					TIMER_COUNTER2_CONTROL_REGISTER|=(3<<CS20);
					break;
				case 256: // clkI/O/256 (From prescaler)
					TIMER_COUNTER2_CONTROL_REGISTER|=(1<<CS22);
					break;
				case 1024: // clkI/O/1024 (From prescaler)
					TIMER_COUNTER2_CONTROL_REGISTER|=(5<<CS20);
					break;
				case 3: // External clock source on T2 pin. Clock on falling edge
					TIMER_COUNTER2_CONTROL_REGISTER|=(6<<CS20);
					break;
				case 5: // External clock source on T2 pin. Clock on rising edge
					TIMER_COUNTER2_CONTROL_REGISTER|=(7<<CS20);
					break;
				default:
					TIMER_COUNTER2_CONTROL_REGISTER|=(5<<CS20);
					break;
			}
			timer2_state=1;
		}	
	}
	void TIMER_COUNTER2_compoutmode(unsigned char compoutmode)
	/*
		compoutmode: Normal port operation, OC0 disconnected; Toggle OC0 on compare match; 
		Clear OC0 on compare match when up-counting. Set OC0 on compare match when downcounting. Clear OC0 on compare match;
		Set OC0 on compare match when up-counting. Clear OC0 on compare match when downcounting. Set OC0 on compare match ;
		default-Normal port operation, OC0 disconnected.
	*/
	{
		TIMER_COUNTER2_CONTROL_REGISTER&=~((1<<COM20) | (1<<COM21));
		switch(compoutmode){ // see table 53, 54, 55 in datasheet for more information
			case 0: // Normal port operation, OC0 disconnected.
				break;
			case 1: // Reserved
					// Toggle OC0 on compare match
				TIMER_COUNTER2_CONTROL_REGISTER|=(1<<COM20);
				break;
			case 2: // Clear OC0 on compare match when up-counting. Set OC0 on compare
					// match when downcounting.
					// Clear OC0 on compare match
				TIMER_COUNTER2_CONTROL_REGISTER|=(1<<COM21);
				break;
			case 3: // Set OC0 on compare match when up-counting. Clear OC0 on compare
					// match when downcounting.
					// Set OC0 on compare match
				TIMER_COUNTER2_CONTROL_REGISTER|=(1<<COM20) | (1<<COM21);
				break;
			default:
				break;
		}
	}
	void TIMER_COUNTER2_compare(unsigned char compare)
	{
		TIMER_COUNTER2_COMPARE_REGISTER=compare;
	}
	void TIMER_COUNTER2_stop(void)
	/*
		stops timer by setting prescaler to zero
	*/
	{
		TIMER_COUNTER2_CONTROL_REGISTER&=~(7<<CS20); // No clock source. (Timer/Counter stopped)
		TIMER_COUNTER2_REGISTER=0X00;
		timer2_state=0;
	}
	/*****************************************************************************************/
	TIMER_COUNTER3 TIMER_COUNTER3enable(unsigned char wavegenmode, unsigned char interrupt)
	/*
		PARAMETER SETTING
		wavegen mode: Normal; PWM, Phase Correct, 8-bit; PWM, Phase Correct, 9-bit; PWM, Phase Correct, 10-bit;
		CTC; Fast PWM, 8-bit; Fast PWM, 9-bit; Fast PWM, 10-bit; PWM, Phase and Frequency Correct; PWM, Phase and Frequency Correct;
		PWM, Phase Correct; PWM, Phase Correct; CTC; (Reserved); Fast PWM; Fast PWM.
		interrupt: off; overflow; output compare; both; default - non.
		for more information read datasheet.
	*/
	{
		TIMER_COUNTER3 timer3;
		timer3_state=0;
		TIMER_COUNTER3A_CONTROL_REGISTER&=~((1<<WGM31) | (1<<WGM30));
		TIMER_COUNTER3B_CONTROL_REGISTER&=~((1<<WGM33) | (1<<WGM32));
		switch(wavegenmode){
			case 0: // Normal
				break;
			case 1: // PWM, Phase Correct, 8-bit
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM30);
				break;
			case 2:	// PWM, Phase Correct, 9-bit
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31);
				break;
			case 3:	// PWM, Phase Correct, 10-bit
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31) | (1<<WGM30);
				break;
			case 4:	// CTC
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM32);
				break;
			case 5:	// Fast PWM, 8-bit
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM30);
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM32);
				break;
			case 6:	// Fast PWM, 9-bit
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31);
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM32);
				break;
			case 7:	// Fast PWM, 10-bit
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31) | (1<<WGM30);
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM32);
				break;
			case 8:	// PWM, Phase and Frequency Correct
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33);
				break;
			case 9:	// PWM, Phase and Frequency Correct
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM30);
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33);
				break;
			case 10: // PWM, Phase Correct
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31);
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33);
				break;
			case 11: // PWM, Phase Correct
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31) | (1<<WGM30);
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33);
				break;
			case 12: // CTC
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33) | (1<<WGM32);
				break;
			case 13: // (Reserved)
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM30);
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33) | (1<<WGM32);
				break;
			case 14: // Fast PWM
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31);
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33) | (1<<WGM32);
				break;
			case 15: // Fast PWM
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31) | (1<<WGM30);
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33) | (1<<WGM32);
				break;
			default:
				break;
		}
		TIMER_COUNTER3A_CONTROL_REGISTER&=~((3<<COM3A0) | (3<<COM3B0)| (3<<COM3C0));
		EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER&=~((1<<TICIE3) | (1<<OCIE3A) | (1<<OCIE3B) | (1<<TOIE3) | (1<<OCIE3C));
		switch(interrupt){
			case 0:
				break;
			case 1:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER=(1<<TOIE3);
				break;
			case 2:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3A);
				break;
			case 3:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3B);
				break;
			case 4:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3C);
				break;
			case 5:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TICIE3);
				break;
			case 6:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3A) | (1<<TOIE3);
				break;
			case 7:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3B) | (1<<TOIE3);
				break;
			case 8:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TOIE3) | (1<<OCIE3C);
				break;
			case 9:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TICIE3) | (1<<TOIE3);
				break;
			case 10:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3A) | (1<<OCIE3B) | (1<<TOIE3);
				break;
			case 11:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3A) | (1<<OCIE3B) | (1<<TOIE3) | (1<<OCIE3C);
				break;
			case 12:
				EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3A) | (1<<OCIE3B) | (1<<OCIE3C);
				break;
			default:
				break;
		}
		//
		timer3.compoutmodeA=TIMER_COUNTER3_compoutmodeA;
		timer3.compoutmodeB=TIMER_COUNTER3_compoutmodeB;
		timer3.compoutmodeC=TIMER_COUNTER3_compoutmodeC;
		timer3.compareA=TIMER_COUNTER3_compareA;
		timer3.compareB=TIMER_COUNTER3_compareB;
		timer3.compareC=TIMER_COUNTER3_compareC;
		timer3.start=TIMER_COUNTER3_start;
		timer3.stop=TIMER_COUNTER3_stop;
		//
		return timer3;
	}
	void TIMER_COUNTER3_start(unsigned int prescaler)
	/*
		PARAMETER SETTING
		Frequency oscilator devision factor or prescaler.
		prescaler: clk T0S /(No prescaling); clk T0S /8 (From prescaler); clk T0S /64 (From prescaler);
		clk T0S /256 (From prescaler); clk T0S /1024 (From prescaler); External clock source on Tn pin. Clock on falling edge;
		External clock source on Tn pin. Clock on rising edge; default - clk T 0 S /1024 (From prescaler).
	*/
	{
		if(timer3_state==0){ // oneshot
			TIMER_COUNTER3A_COMPARE_REGISTER=0XFFFF;
			TIMER_COUNTER3B_CONTROL_REGISTER&=~(7<<CS30); // No clock source. (Timer/Counter stopped)
			switch(prescaler){
				case 1: // clkI/O/1 (No prescaling
					TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<CS30);
					break;
				case 8: // clkI/O/8 (From prescaler)
					TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<CS31);
					break;
				case 64: // clkI/O/64 (From prescaler)
					TIMER_COUNTER3B_CONTROL_REGISTER|=(3<<CS30);
					break;
				case 256: // clkI/O/256 (From prescaler)
					TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<CS32);
					break;
				case 1024: // clkI/O/1024 (From prescaler)
					TIMER_COUNTER3B_CONTROL_REGISTER|=(5<<CS30);
					break;
				case 3: // External clock source on Tn pin. Clock on falling edge
					TIMER_COUNTER3B_CONTROL_REGISTER|=(6<<CS30);
					break;
				case 5: // External clock source on Tn pin. Clock on rising edge
					TIMER_COUNTER3B_CONTROL_REGISTER|=(7<<CS30);
					break;
				default:
					TIMER_COUNTER3B_CONTROL_REGISTER|=(5<<CS30);
					break;
			}
			timer3_state=1;
		}	
	}
	void TIMER_COUNTER3_compoutmodeA(unsigned char compoutmode)
	{
		TIMER_COUNTER3A_CONTROL_REGISTER&=~(3<<COM3A0);
		switch(compoutmode){ // see table 53, 54, 55 in datasheet for more information
			case 0: // Normal port operation, OC0 disconnected.
				break;
			case 1: // Reserved
					// Toggle OC0 on compare match
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3A0);
				break;
			case 2: // Clear OC0 on compare match when up-counting. Set OC0 on compare
					// match when downcounting.
					// Clear OC0 on compare match
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3A1);
				break;
			case 3: // Set OC0 on compare match when up-counting. Clear OC0 on compare
					// match when downcounting.
					// Set OC0 on compare match
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3A0) | (1<<COM3A1);
				break;
			default:
				break;
		}
	}
	void TIMER_COUNTER3_compoutmodeB(unsigned char compoutmode)
	{
		TIMER_COUNTER3A_CONTROL_REGISTER&=~(3<<COM3B0);
		switch(compoutmode){ // see table 53, 54, 55 in datasheet for more information
			case 0: // Normal port operation, OC0 disconnected.
				break;
			case 1: // Reserved
					// Toggle OC0 on compare match
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3B0);
				break;
			case 2: // Clear OC0 on compare match when up-counting. Set OC0 on compare
					// match when downcounting.
					// Clear OC0 on compare match
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3B1);
				break;
			case 3: // Set OC0 on compare match when up-counting. Clear OC0 on compare
					// match when downcounting.
					// Set OC0 on compare match
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3B0) | (1<<COM3B1);
				break;
			default:
				break;
		}
	}
	void TIMER_COUNTER3_compoutmodeC(unsigned char compoutmode)
	{
		TIMER_COUNTER3A_CONTROL_REGISTER&=~(3<<COM3C0);
		switch(compoutmode){ // see table 53, 54, 55 in datasheet for more information
			case 0: // Normal port operation, OC0 disconnected.
				break;
			case 1: // Reserved
					// Toggle OC0 on compare match
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3C0);
				break;
			case 2: // Clear OC0 on compare match when up-counting. Set OC0 on compare
					// match when downcounting.
					// Clear OC0 on compare match
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3C1);
				break;
			case 3: // Set OC0 on compare match when up-counting. Clear OC0 on compare
					// match when downcounting.
					// Set OC0 on compare match
				TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3C0) | (1<<COM3C1);
				break;
			default:
				break;
		}
	}
	void TIMER_COUNTER3_compareA(uint16_t compare)
	{
		TIMER_COUNTER3A_COMPARE_REGISTER=compare;
	}
	void TIMER_COUNTER3_compareB(uint16_t compare)
	{
		TIMER_COUNTER3B_COMPARE_REGISTER=compare;
	}
	void TIMER_COUNTER3_compareC(uint16_t compare)
	{
		TIMER_COUNTER3C_COMPARE_REGISTER=compare;
	}
	void TIMER_COUNTER3_stop(void)
	/*
		stops timer by setting prescaler to zero
	*/
	{
		TIMER_COUNTER3B_CONTROL_REGISTER&=~(7<<CS30); // No clock source. (Timer/Counter stopped)
		TIMER_COUNTER3_REGISTER=0X0000;
		timer3_state=0;
	}

